app/controllers/contacts_controller.rb

INSERT INTO "contacts" ("nome", "email", "kind_id", "rmk", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["nome", "Guilherme"], ["email", "gsagahc@hotmail.com"], ["kind_id", 2], ["rmk", "Contato pessoal"], ["created_at", "2018-01-07 17:01:40.405407"], ["updated_at", "2018-01-07 17:01:40.405407"]]
---
  def create
    @contact = Contact.new(contact_params)

    respond_to do |format|
      if @contact.save

UPDATE "contacts" SET "kind_id" = ?, "rmk" = ?, "updated_at" = ? WHERE "contacts"."id" = ?  [["kind_id", 1], ["rmk", "Contato Comercial"], ["updated_at", "2018-01-07 17:06:50.637282"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @contact.update(contact_params)